<h1>Datasets Exploring</h1>

In [1]:
import pandas as pd

In [5]:
!pwd

/mnt/d/Projects/linearmodels/docs

In [10]:
bebes = pd.read_csv('../database/bebes.csv'); bebes.head(3)

   comprimento  idade
0        63.07   19.0
1        65.63   21.0
2        65.63   22.5

In [8]:
corrupcao = pd.read_csv('../database/corrupcao.csv'); corrupcao.head(3)

        pais  cpi          regiao
0  Argentina  3.9  America_do_sul
1  Australia  8.7         Oceania
2    Austria  7.9          Europa

In [11]:
empresas = pd.read_csv('../database/paises.csv'); empresas.head(3)

        pais  cpi  idade  horas
0  Argentina  3.9     72   35.0
1  Australia  8.7     64   32.0
2    Austria  7.9     72   32.0

In [15]:
plano_saude = pd.read_csv('../database/planosaude.csv'); plano_saude.head(3)

   id  despmed  idade  dcron      renda   plano
0   1   206.84     57      5  57.200001  bronze
1   2   184.19     67      4  67.199997  bronze
2   3   175.68     62      4  62.000000  bronze

In [16]:
saeb_rend = pd.read_csv('../database/saeb_rend.csv'); saeb_rend.head(3)

,uf,municipio,codigo,escola,rede,saeb,rendimento
0,RO,Alta Floresta D'Oeste,11024666,EMEIEF BOA ESPERANCA,Municipal,5.331833,0.766092
1,RO,Alta Floresta D'Oeste,11024682,EEEF EURIDICE LOPES PEDROSO,Estadual,NaN,0.910890
2,RO,Alta Floresta D'Oeste,11024828,EMEIEF IZIDORO STEDILE,Municipal,5.432333,0.884658

In [17]:
salarios = pd.read_csv('../database/salarios.csv'); salarios.head(3)

,nome,salario,rh1,econometria1,rh2,econometria2,rh3,econometria3
0,Patricia,2525.340820,9.0,4.50,9.0,4.50,3.0,9.0
1,Luiz,2498.574951,8.0,4.00,8.0,4.00,7.0,8.0
2,Dalila,2364.686768,9.5,4.75,9.5,4.75,10.0,9.5

In [18]:
tempodist = pd.read_csv('../database/tempodist.csv'); tempodist.head(3)

   tempo  distancia
0     15          8
1     20          6
2     20         15